<a href="https://colab.research.google.com/github/shcho11/Python_Basics_memo3/blob/main/pandas_practice_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
        "year": [2016, 2017, 2018, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

      names  year  points
0  sunyoung  2016     1.5
1  sunyoung  2017     1.7
2  sunyoung  2018     3.6
3   jungjae  2015     2.4
4   jungjae  2016     2.9

In [ ]:
df= pd.DataFrame(data, columns=['year','names','points','penalty'], index=['one','two','three','four','five'])

In [ ]:
df

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [ ]:
df.loc['one',:]

year           2016
names      sunyoung
points          1.5
penalty         NaN
Name: one, dtype: object

In [ ]:
df.loc[['one','three'],'names':'points']

          names  points
one    sunyoung     1.5
three  sunyoung     3.6

In [ ]:
df.loc[:,'names':'points']

          names  points
one    sunyoung     1.5
two    sunyoung     1.7
three  sunyoung     3.6
four    jungjae     2.4
five    jungjae     2.9

In [ ]:
df['penalty'] = [0.1,0.2,0.3,0.4,0.5]
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.3
four   2015   jungjae     2.4      0.4
five   2016   jungjae     2.9      0.5

In [ ]:
import numpy as np

In [ ]:
df['penalty'] = [0.1,0.2,0.5,0.3,np.nan]

In [ ]:
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.5
four   2015   jungjae     2.4      0.3
five   2016   jungjae     2.9      NaN

In [ ]:
df.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [ ]:
df.values

array([[2016, 'sunyoung', 1.5, 0.1],
       [2017, 'sunyoung', 1.7, 0.2],
       [2018, 'sunyoung', 3.6, 0.5],
       [2015, 'jungjae', 2.4, 0.3],
       [2016, 'jungjae', 2.9, nan]], dtype=object)

In [ ]:
df.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [ ]:
df.dtypes

year         int64
names       object
points     float64
penalty    float64
dtype: object

In [ ]:
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.5
four   2015   jungjae     2.4      0.3
five   2016   jungjae     2.9      NaN

In [ ]:
df['rank'] = np.arange(5)

In [ ]:
df

       year     names  points  penalty  rank
one    2016  sunyoung     1.5      0.1     0
two    2017  sunyoung     1.7      0.2     1
three  2018  sunyoung     3.6      0.5     2
four   2015   jungjae     2.4      0.3     3
five   2016   jungjae     2.9      NaN     4

In [ ]:
df['net_points'] = df['points'] - df['penalty']
df

       year     names  points  penalty  rank  net_points  high_points
one    2016  sunyoung     1.5      0.1     0         1.4        False
two    2017  sunyoung     1.7      0.2     1         1.5        False
three  2018  sunyoung     3.6      0.3     2         3.3         True
four   2015   jungjae     2.4      0.4     3         2.0        False
five   2016   jungjae     2.9      0.5     4         2.4        False

In [ ]:
df['high_points'] = df['net_points'] > 3
df

       year     names  points  penalty  rank  net_points  high_points
one    2016  sunyoung     1.5      0.1     0         1.4        False
two    2017  sunyoung     1.7      0.2     1         1.5        False
three  2018  sunyoung     3.6      0.3     2         3.3         True
four   2015   jungjae     2.4      0.4     3         2.0        False
five   2016   jungjae     2.9      0.5     4         2.4        False

In [ ]:
df['penalty'] = [0.1,0.2,0.3,0.4,0.5]
df

       year     names  points  penalty  rank  net_points  high_points
one    2016  sunyoung     1.5      0.1     0         1.4        False
two    2017  sunyoung     1.7      0.2     1         1.5        False
three  2018  sunyoung     3.6      0.3     2         3.3         True
four   2015   jungjae     2.4      0.4     3         2.0        False
five   2016   jungjae     2.9      0.5     4         2.4        False

In [ ]:
del df['rank']

In [ ]:
del df['net_points']

In [ ]:
del df['high_points']

In [ ]:
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.3
four   2015   jungjae     2.4      0.4
five   2016   jungjae     2.9      0.5

In [ ]:
# six 라는 인덱스를 가지는 새로운 행을 추가하고, 값을 대입
df.loc['six',:] = [2021,'songhyun',9.9,0.1]
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.3
four   2015   jungjae     2.4      0.4
five   2016   jungjae     2.9      0.5
six    2021  songhyun     9.9      0.1

In [ ]:
df['year'] = df['year'].astype('float64')
df

         year     names  points  penalty
one    2016.0  sunyoung     1.5      0.1
two    2017.0  sunyoung     1.7      0.2
three  2018.0  sunyoung     3.6      0.3
four   2015.0   jungjae     2.4      0.4
five   2016.0   jungjae     2.9      0.5
six    2021.0  songhyun     9.9      0.1

In [ ]:
df['year'] = df['year'].astype('int')
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.3
four   2015   jungjae     2.4      0.4
five   2016   jungjae     2.9      0.5
six    2021  songhyun     9.9      0.1

In [ ]:
df.loc[df['year'] > 2017, :]

       year     names  points  penalty
three  2018  sunyoung     3.6      0.3
six    2021  songhyun     9.9      0.1

In [ ]:
df.loc[df['names'] == 'sunyoung']

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.3

In [ ]:
df.loc[(df['points']>2) & (df['points']<6), 'names':'points']

          names  points
three  sunyoung     3.6
four    jungjae     2.4
five    jungjae     2.9

In [ ]:
#points가 6보다 큰 사람의 penalty를 0으로 만든다.
df.loc[(df['points']>6), 'penalty'] = 0
df

       year     names  points  penalty
one    2016  sunyoung     1.5      0.1
two    2017  sunyoung     1.7      0.2
three  2018  sunyoung     3.6      0.3
four   2015   jungjae     2.4      0.4
five   2016   jungjae     2.9      0.5
six    2021  songhyun     9.9      0.0